In [103]:
import pandas as pd
import numpy as np

In [104]:
data = {
    "Name": ["Ana", "Ben", "Cara"],
    "Age": [22, 25, 28],
    "City": ["Manila", "Cebu", "Davao"]
}

df = pd.DataFrame(data)
df

   Name  Age    City
0   Ana   22  Manila
1   Ben   25    Cebu
2  Cara   28   Davao

In [105]:
df.head(2)

  Name  Age    City
0  Ana   22  Manila
1  Ben   25    Cebu

In [106]:
df.columns

Index(['Name', 'Age', 'City'], dtype='str')

In [107]:
df.describe()

        Age
count   3.0
mean   25.0
std     3.0
min    22.0
25%    23.5
50%    25.0
75%    26.5
max    28.0

In [108]:
df["Age"]

0    22
1    25
2    28
Name: Age, dtype: int64

In [109]:
df[df["Age"] > 23]

   Name  Age   City
1   Ben   25   Cebu
2  Cara   28  Davao

In [110]:
df["Age_in_5_years"] = df["Age"] + 5
df

   Name  Age    City  Age_in_5_years
0   Ana   22  Manila              27
1   Ben   25    Cebu              30
2  Cara   28   Davao              33

In [111]:
df["Salary"] = [30_000, np.nan, 45_000]
df

   Name  Age    City  Age_in_5_years   Salary
0   Ana   22  Manila              27  30000.0
1   Ben   25    Cebu              30      NaN
2  Cara   28   Davao              33  45000.0

In [112]:
df.isnull

<bound method DataFrame.isnull of    Name  Age    City  Age_in_5_years   Salary
0   Ana   22  Manila              27  30000.0
1   Ben   25    Cebu              30      NaN
2  Cara   28   Davao              33  45000.0>

In [113]:
df["Salary"] = df["Salary"].fillna(df["Salary"].mean())
df

   Name  Age    City  Age_in_5_years   Salary
0   Ana   22  Manila              27  30000.0
1   Ben   25    Cebu              30  37500.0
2  Cara   28   Davao              33  45000.0

In [114]:
df["Salary_taxed"] = df["Salary"].apply(lambda x: x * 0.9)
df

   Name  Age    City  Age_in_5_years   Salary  Salary_taxed
0   Ana   22  Manila              27  30000.0       27000.0
1   Ben   25    Cebu              30  37500.0       33750.0
2  Cara   28   Davao              33  45000.0       40500.0

In [115]:
data2 = {
    "Dept": ["IT", "HR", "IT", "HR"],
    "Salary": [50_000, 40_000, 60_000, 45_000]
}

df2 = pd.DataFrame(data2)

In [116]:
df2.groupby("Dept")["Salary"].mean()

Dept
HR    42500.0
IT    55000.0
Name: Salary, dtype: float64

In [117]:
df01 = pd.DataFrame({
    "ID": [1, 2],
    "Name": ["Ana", "Ben"]
})

df02 = pd.DataFrame({
    "ID": [1, 2],
    "Salary": [30_000, 40_000]
})

In [118]:
df03 = pd.merge(df01, df02, on="ID")
df03

   ID Name  Salary
0   1  Ana   30000
1   2  Ben   40000

In [119]:
data3 = {
    "Dept": ["IT", "IT", "HR", "HR"],
    "Gender": ["M", "F", "F", "M"],
    "Salary": [60000, 55000, 45000, 47000]
}

df3 = pd.DataFrame(data3)

df3.pivot_table(values="Salary", index="Dept", aggfunc="mean")

       Salary
Dept
HR    46000.0
IT    57500.0

In [120]:
df4 = pd.DataFrame({
    "Date": ["2025-01-01", "2025-06-15", "2026-02-10", "2026-12-01"]
})

In [121]:
df4["Date"] = pd.to_datetime(df4["Date"])
df4["Year"] = df4["Date"].dt.year
df4

        Date  Year
0 2025-01-01  2025
1 2025-06-15  2025
2 2026-02-10  2026
3 2026-12-01  2026

In [122]:
df5 = pd.DataFrame({
    "Salary": [30_000, 35_000, 40_000, 45_000]
})

df5["Rolling_Avg"] = df["Salary"].rolling(2).mean()
df5

   Salary  Rolling_Avg
0   30000          NaN
1   35000      33750.0
2   40000      41250.0
3   45000          NaN

In [123]:
df6 = pd.DataFrame({
    "Dept": ["IT", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 40000, 45000]
})

df6["Salary_norm"] = df6.groupby("Dept")["Salary"].transform(
    lambda x: x / x.sum()
)

df6

  Dept  Salary  Salary_norm
0   IT   50000     0.454545
1   IT   60000     0.545455
2   HR   40000     0.470588
3   HR   45000     0.529412

In [126]:
df7 = pd.DataFrame({
    "Name": ["Ana", "Ben"],
    "Math": [90, 85],
    "Science": [88, 92]
})
df7

  Name  Math  Science
0  Ana    90       88
1  Ben    85       92

In [125]:
pd.melt(
    df7,
    id_vars="Name",
    value_vars=["Math", "Science"],
    var_name="Subject",
    value_name="Score"
)

  Name  Subject  Score
0  Ana     Math     90
1  Ben     Math     85
2  Ana  Science     88
3  Ben  Science     92